Revit 2027 API
TriOrQuadFacet Properties
The TriOrQuadFacet type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Normal |  A unit normal vector for this facet.
NumberOfVertices |  The number of vertices (3 for a triangle, 4 for a quadrilateral, 0 for an unset TriOrQuadFacet).
Top
See Also
Reference
TriOrQuadFacet Class
Autodesk.Revit.DB Namespace